### Як скролите ви?)

Одного разу, мені потрібно було дістатися до запису на сторінці в соціалці (ВК). 
Ну, як там в них заведено, стіна реалізована через підвантаження нових постів по мірі переміщення в низ сторінки.
Потрібний пост знаходився, як всі вже здогадались, казна-де.
Тому, недовго думаючи був написаний шматочок JS:
```js
var f = function () {window.scrollTo(0,document.body.scrollHeight); };
var h = setInterval(f,500);
```

І аби колись зупинити цей вічний двигун юзнулась команда: `clearInterval(h);`
Зрозуміло, що все це виконувалося в консолі DevTools.
Як результат, я знайшов потрібний пост)
